# Задача на цикл while
# Напишите детскую считалочку раз, два, три, четыре, пять, я иду искать !

i = 1
while i <= 5:
    print (i)
    i +=1

print ('Я иду искать')