# Напишите цикл где на первых трех итерация ничего делать не нужно


for i in range (10):
    if i < 3:
        pass
    else:
        print (i)